reddit_on_rails/app/controllers/application_controller.rb

  def log_out!
    current_user.reset_session_token!
    current_user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GJMk5-0BgFyboHmTY51BVg"], ["updated_at", "2018-10-23 18:18:43.826248"], ["id", 4]]