reddit_on_rails/app/controllers/subs_controller.rb

  def create
    @sub = current_user.subs.new(sub_params)
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ejyjyjy"], ["description", "etyjey"], ["user_id", 4], ["created_at", "2018-10-23 19:50:32.499407"], ["updated_at", "2018-10-23 19:50:32.499407"]]

  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "please work"], ["updated_at", "2018-10-23 20:28:41.238366"], ["id", 10]]

  def destroy
    subreddit = Sub.find(params[:id])
    subreddit.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 12]]

  def ensure_moderator
    subreddit = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]