reddit_on_rails/app/views/subs/index.html.erb

<ul>
<% Sub.all.each do |subreddit| %>
---
SELECT "subs".* FROM "subs"