reddit_on_rails/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "DarthVader"], ["LIMIT", 1]]
---
  def self.find_by_credentials(passed_user, passed_word)
    user = User.find_by(username: passed_user)